[
  {
    "Faculty": "Faculty of Law",
    "Major": "Law",
    "10th Percentile A Levels": "AAA/A",
    "90th Percentile A Levels": "AAA/A",
    "10th Percentile GPA": "3.82",
    "90th Percentile GPA": "3.98",
    "Description": "The Bachelor of Laws (Honours) (LLB) undergraduate degree is a professional degree recognised for admission to practise in Singapore. Our graduates have also been admitted to practise in Malaysia, in several Commonwealth jurisdictions such as Australia, Canada and the United Kingdom, and some states in the USA such as California and New York.\n\nThe majority of the LLB students apply to the Faculty of Law after completing their pre-university studies. Most of these students enrol in the 4-Year LLB programme while others may enrol in our double degree programmes or our concurrent degree programme. Others may also apply to read the Juris Doctor (JD) programme after completing a degree in another discipline.",
    "Link": "https://law.nus.edu.sg/"
  },
  {
    "Faculty": "School of Medicine",
    "Major": "Medicine",
    "10th Percentile A Levels": "AAA/A",
    "90th Percentile A Levels": "AAA/A",
    "10th Percentile GPA": "3.86",
    "90th Percentile GPA": "3.98",
    "Description": "Bachelor of Medicine and Bachelor of Surgery (MBBS) by Yong Loo Lin School of Medicine\n\nThe five-year curriculum is future-oriented, inter-disciplinary and inter-professional in nature. They provide a holistic learning experience that expose our students to multiple facets of healthcare and prepares them to become visionary leaders and compassionate doctors of tomorrow.\n\nFirst-rate patient care begins with a holistic and integrated medical curriculum, so their teachers collaborate across phases and disciplines to innovate teaching and close learning gaps.\n\nThey teach traditional subjects in an integrated fashion, so students learn holistically about body systems and medical science basics for clinical conditions.\n\nThey place great emphasis on treating the patient, not just the disease, to provide students with a longitudinal perspective from wellness to illness to death, and from hospital to community. They expose their students to subjects beyond the field of medicines, foster cross-disciplinary learning and opportunities, equipping them with diverse skillsets that enables them to effect physical, mental and social well-being for our population.",
    "Link": "https://medicine.nus.edu.sg/"
  },
  {
    "Faculty": "School of Medicine",
    "Major": "Nursing",
    "10th Percentile A Levels": "CCD/B",
    "90th Percentile A Levels": "AAA/C",
    "10th Percentile GPA": "3.42",
    "90th Percentile GPA": "3.85",
    "Description": "The Bachelor of Science (Nursing) degree is a 3-year programme. Students who have performed well throughout the programme and achieved a minimum cumulative average point of 3.2 are eligible to apply to proceed to the Honours year leading to BSc (Nursing)(Honours).\n\nApplicants presenting an acceptable Diploma from a Polytechnic in Singapore can apply. The extent of advanced standing for diploma holders from a local polytechnic will be reviewed and granted in accordance with NUS rules and regulations.\n\nUpon completion of the programme, graduates can apply to register with the Singapore Nursing Board to practise as Registered Nurses.\n\nClinical practicum experiences are the core of the Alice Lee Centre for Nursing Studies (ALCNS) Bachelor of Science (BSc) (Nursing) programme which has adopted the SPICES (Student-centred; Problem-based; Integrated; Community and hospital-based; opportunities for Electives and a Systematic approach to clinical education (Harden, et al 1984)) curriculum model in its design, development and delivery; and a framework that incorporates core concepts of Health, Person, Environment and Nursing (ALCNS, 2010).\n\nThe clinical practicum modules enable students to develop clinical skills and professional competency through a structured programme that includes on-campus clinical laboratory learning, simulation experiences and clinical attachments in various healthcare institutes.",
    "Link": "https://medicine.nus.edu.sg/nursing/"
  },
  {
    "Faculty": "Faculty of Dentistry",
    "Major": "Dentistry",
    "10th Percentile A Levels": "AAA/A",
    "90th Percentile A Levels": "AAA/A",
    "10th Percentile GPA": "#",
    "90th Percentile GPA": "#",
    "Description": "The Faculty of Dentistry offers a four-year full-time undergraduate course leading to the Bachelor of Dental Surgery (BDS) degree. Students who consistently perform well in their professional examinations across the four years may be considered for the BDS (Honours) degree.   \n\nThe Faculty has a current undergraduate student population of over 220.\n\nThe NUS BDS degree is recognised by the Singapore Dental Council for registration to practise in Singapore. Upon graduation, BDS graduates will begin their careers in dentistry in the public sector during the period of their bond.\n\nThe BDS course starts in July of each Academic Year. Major vacation periods are in December and June with shorter breaks in Mar and Sep.\nThe four-year dental course is divided into pre-clinical (Years 1 and 2) and Clinical (Years 3 and 4) components. During the pre-clinical years, undergraduates gain knowledge across a broad range of basic life sciences.  The dental sciences are also introduced from the first year.  This is complemented by extensive hands-on simulation and laboratory-based training to prepare them for the clinical management of patients.\n\nIn the clinical years, undergraduates manage the oral health needs of patients across the lifespan and provide them with a comprehensive scope of dental treatment, under close staff supervision. As part of the clinical training, relevant aspects of Medicine, Surgery and Paediatrics are also included in the third year of the course. \n\nThe Faculty of Dentistry is organised into 6 Disciplines\n\n1. Oral Sciences\n2. Oral, and Maxillofacial Surgery;\n3. Endodontics Operative Dentistry and Prosthodontics;\n4. Periodontics;\n5. Orthodontics and Paediatric Dentistry as well as\n6. Primary Dental Care and Population Oral Health.\n\nThe academic staff across these disciplines provide the dental undergraduates with wide exposure to various aspects of dentistry and extensive experience in general dental practice.",
    "Link": "https://www.dentistry.nus.edu.sg/"
  },
  {
    "Faculty": "College of Design and Engineering",
    "Major": "Architecture",
    "10th Percentile A Levels": "BBC/C",
    "90th Percentile A Levels": "AAA/A",
    "10th Percentile GPA": "3.56",
    "90th Percentile GPA": "3.93",
    "Description": "The B.A. (Arch) is a preeminent four-year Honours degree programme that serves as the core foundation for concurrent Master programmes offered by NUS Architecture.\n\nThe B.A. (Arch) champions design excellence through studio research, exploration, and making. The fundamental skills of drawing, model-making and representation are complemented by an inspiring and liberal arts-based curriculum comprising architectural history, theory, tectonics as well as systems and technologies, in the first three years of study. An extensive range of issues drive studio research topics, promoting a development of skills necessary for students to take on complex issues of the built environment.\n\nIn the first year, students are introduced to foundational concepts in design, representation and critical thinking through making. Through various exercises and projects, students are exposed to a broad range of issues, addressed through the design of the environment. Concepts studied rigorously include, space, precedent, materiality as well as the equatorial environment.\n\nThe second and third year of the B.A. (Arch) investigate issues of structure, site, program and envelope. Students research complex approaches to architectural formation, while extending their knowledge of cultural, aesthetic, and construction concerns.\n\nStudents have the option of choosing their individual specialisation in their final year of study, leading on to concurrent Master programmes. The sequence encourages independent and advanced thinking as a preparation for Master level architectural research.",
    "Link": "https://cde.nus.edu.sg/arch/programmes/bachelor-of-arts-in-architecture/"
  },
  {
    "Faculty": "College of Design and Engineering",
    "Major": "Engineering",
    "10th Percentile A Levels": "BCC/B",
    "90th Percentile A Levels": "AAA/A",
    "10th Percentile GPA": "3.56",
    "90th Percentile GPA": "3.94",
    "Description": "CDE takes advantage of the natural synergies and growing convergence between the fields of Engineering and Design to offer a distinctive, interdisciplinary education. Exposure to real-world scenarios, broad domain expertise and cutting-edge research in your university education will empower you to thrive in your future professional roles.\n\nThere are a total of 10 engineering majors to choose from (excluding Computer Engineering). The full list is as follows:\n\n1. Biomedical Engineering\n2. Chemical Engineering\n3. Civil Engineering\n4. Electrical Engineering\n5. Engineering Science\n6. Enviornmental Engineering\n7. Industrial and Systems Engineering\n8. Infrastructure and Project Management\n9. Materials Science and Engineering\n10. Mechanical Engineering\n\nMore details on each of these majors can be found on the website.",
    "Link": "https://cde.nus.edu.sg/"
  },
  {
    "Faculty": "College of Design and Engineering",
    "Major": "Industrial Design",
    "10th Percentile A Levels": "BBC/C",
    "90th Percentile A Levels": "AAA/A",
    "10th Percentile GPA": "3.62",
    "90th Percentile GPA": "3.93",
    "Description": "The Bachelor of Arts in Industrial Design is a four-year full-time undergraduate honours programme by coursework.\n\nIndustrial Design is a human-centred problem-solving process driven by creativity, innovation, and research. Its goal is to create and deliver products, services, and communication that enhance the human experience while building business success. It is a trans-disciplinary profession that harnesses creativity to resolve problems and collaboratively creates solutions with the intent of making a product, space, system, service, experience, or business better.\n\nAt its core, Industrial Design provides an optimistic way of looking at the future by reframing problems as opportunities. It links innovation, technology, research, business, and consumer behaviour to provide new value and competitive advantage across economic, social, and environmental territories.\nThe Bachelor of Arts in Industrial Design is a four-year full-time undergraduate honours programme by coursework.\n\nIndustrial Design is a human-centred problem-solving process driven by creativity, innovation, and research. Its goal is to create and deliver products, services, and communication that enhance the human experience while building business success. It is a trans-disciplinary profession that harnesses creativity to resolve problems and collaboratively creates solutions with the intent of making a product, space, system, service, experience, or business better.\n\nAt its core, Industrial Design provides an optimistic way of looking at the future by reframing problems as opportunities. It links innovation, technology, research, business, and consumer behaviour to provide new value and competitive advantage across economic, social, and environmental territories.\nThe Bachelor of Arts in Industrial Design is a four-year full-time undergraduate honours programme by coursework.\n\nIndustrial Design is a human-centred problem-solving process driven by creativity, innovation, and research. Its goal is to create and deliver products, services, and communication that enhance the human experience while building business success. It is a trans-disciplinary profession that harnesses creativity to resolve problems and collaboratively creates solutions with the intent of making a product, space, system, service, experience, or business better.\n\nAt its core, Industrial Design provides an optimistic way of looking at the future by reframing problems as opportunities. It links innovation, technology, research, business, and consumer behaviour to provide new value and competitive advantage across economic, social, and environmental territories.\n",
    "Link": "https://cde.nus.edu.sg/did/undergraduate/"
  },
  {
    "Faculty": "College of Design and Engineering",
    "Major": "Landscape Architecture",
    "10th Percentile A Levels": "BCC/B",
    "90th Percentile A Levels": "AAA/A",
    "10th Percentile GPA": "3.38",
    "90th Percentile GPA": "3.9",
    "Description": "The Bachelor of Landscape Architecture (BLA) is a four-year Honours degree programme that prepares students to respond to multifaceted socio-ecological issues in Asia through critical thinking, analytical inquiry, and creative expression. BLA provides core foundation training in skills and knowledge that equips our graduates for professional practice or entry into advanced Master degree programmes. Relevant topics, including tropicality, site specificity, boundaries and scales, densification, multifunctionality, and placemaking are played out in the programme through integrated learning platforms in design studios and lectures. BLA is taught in unique education settings that concurrently promotes speculation in design and at the same time being produces grounded and action-oriented design outcomes relevant to real life issues.",
    "Link": "https://cde.nus.edu.sg/arch/programmes/bachelor-of-landscape-architecture/"
  },
  {
    "Faculty": "School of Computing",
    "Major": "Computer Engineering",
    "10th Percentile A Levels": "AAB/B",
    "90th Percentile A Levels": "AAA/A",
    "10th Percentile GPA": "3.88",
    "90th Percentile GPA": "4",
    "Description": "The Computer Engineering programme(CEG) at NUS prepares its graduates to embark on a lifelong journey in designing computing systems for a smarter world ? hence the theme \"Designing Intelligence\".\n\nA sophisticated piece of hardware is useless without the software that brings it to life. Computer engineers introduce intelligence into every conceivable device --- from the smart phone that you cannot live without, to massive industrial control systems that power economies. They create the electronic systems in a modern car containing dozens of computing systems communicating through a network. They connect the physical world with cyberspace to enhance everything from entertainment to healthcare and the environment. CEG gives you the skills and knowledge to engineer exciting solutions that move as well as change the world.\n\nA uniquely multi-disciplinary programme, CEG transcends the traditional boundary of computer science and electrical engineering. You will enjoy the resources and opportunities offered by both the host departments: Computer Science and Electrical & Computer Engineering. The curriculum aims to bring real-world problems, solutions, and experiences into the university environment. You will have the opportunity to consolidate your knowledge through a unique Full-Year industrial attachment, and through overseas work or learning experience. With the solid fundamentals that the NUS Computer Engineering degree will give you, only imagination and ambition will be your limits.",
    "Link": "https://ceg.nus.edu.sg/"
  },
  {
    "Faculty": "School of Computing",
    "Major": "Business Analytics",
    "10th Percentile A Levels": "AAA/A",
    "90th Percentile A Levels": "AAA/A",
    "10th Percentile GPA": "3.81",
    "90th Percentile GPA": "3.97",
    "Description": "Bachelor of Science in Business Analytics (with Honours)\n\nToday's businesses run on data. From web analytics and accounting to market research and demographics, our information-centric world generates countless terabytes of data year after year. Data analysts play the increasingly important role of making sense of all that data.\n\nAs a Business Analytics student, you will gain a solid foundation in the statistical and analytical methods that make up the backbone of data science. You'll learn to work with spreadsheets, aggregate data, evaluate statistical significance, and determine statistical trends.\n\nWith a background in Business Analytics, you can find a niche in almost any industry. Data analysts can be found everywhere from IT consultancies to web marketing agencies, inside government bureaus and at leading startups.\n\nAn NUS education provides a strong technical foundation across all areas of computing, meaning that your Business Analytics training will be bolstered by strong general computer skills. Accordingly, a Business Analytics degree from NUS will provide you with the skills and expertise needed to build a career in today's fastest-growing and most exciting profession.",
    "Link": "https://www.comp.nus.edu.sg/programmes/ug/ba/"
  },
  {
    "Faculty": "School of Computing",
    "Major": "Computer Science",
    "10th Percentile A Levels": "AAA/A",
    "90th Percentile A Levels": "AAA/A",
    "10th Percentile GPA": "3.84",
    "90th Percentile GPA": "3.99",
    "Description": "Bachelor of Computing in Computer Science (with Honours)\n\nDeveloping cutting edge applications. Studying the latest developments in AI and machine learning. Working with industry leaders in software, social media and gaming. These are just a few of the opportunities you'll have as a Computer Science student at NUS.\n\nWith deep connections at leading companies, NUS offers a truly immersive Computer Science education. We pride ourselves on providing the strongest technical foundation available at any institution in Singapore, across all sub-disciplines of computing. Although our programme is well grounded in theory, we place a special emphasis on skills that matter to employers. As part of your education, you will build and develop applications, while learning the theoretical foundations of Computer Science that make it all possible.\n\nThe end goal of our Computer Science programme is to prepare candidates for a rewarding career as computing professionals. Our graduates have gone on to illustrious careers at leading companies, from Silicon Valley startups to Wall Street banks. Our project-based approach means that you will build a portfolio that you can showcase to employers to demonstrate your achievements as a software developer and engineer.\n\nA career in Computer Science gives you the opportunity to build the future. Your NUS education provides the foundation you need for a career at the cutting edge of technology.",
    "Link": "https://www.comp.nus.edu.sg/programmes/ug/cs/"
  },
  {
    "Faculty": "School of Computing",
    "Major": "Information Security",
    "10th Percentile A Levels": "AAA/B",
    "90th Percentile A Levels": "AAA/A",
    "10th Percentile GPA": "3.8",
    "90th Percentile GPA": "3.97",
    "Description": "Bachelor of Computing in Information Security (with Honours)\n\nIdentifying vulnerabilities in cloud servers. Developing e-mail security protocols for your department's internal communications network. These are just some of the things you'll be doing in a typical day as an information security student.\n\nInformation Security is all about keeping computer systems safe. As a student of this programme, you'll learn to identify vulnerabilities in systems, develop security protocols, and respond to attempted breaches.\n\nIn your studies, you will learn everything you need to secure and safeguard computer systems. From cryptography and malware detection to social engineering and security law, you will gain a foundation in security that includes both the technical and social aspects of the subject.\n\nWith cyber-attacks on the rise every day, there has never been a greater demand for information security professionals. An Information Security degree from NUS provides the skills needed to keep systems safe from security breaches, as well as a strong foundation in all relevant areas of computer science. It's a fast-growing field that will only become more in-demand as organisations realise the urgent need to keep their systems safe.",
    "Link": "https://www.comp.nus.edu.sg/programmes/ug/isc/"
  },
  {
    "Faculty": "School of Computing",
    "Major": "Information Systems",
    "10th Percentile A Levels": "AAA/B",
    "90th Percentile A Levels": "AAA/A",
    "10th Percentile GPA": "3.76",
    "90th Percentile GPA": "3.97",
    "Description": "Bachelor of Computing in Information Systems (with Honours)\n\nImagine designing enterprise architecture for leading global companies. Consulting with a hedge fund on how respond to the challenge of blockchain technology. Working as an IT manager at one of the world's leading consulting firms.\n\nAs an Information Systems student at NUS, you'll learn the crucial skills needed to prepare you for exciting careers. Information Systems is all about designing, implementing and managing IT. The field is broad and wide-reaching, with potential careers in almost every industry.\n\nNUS prides itself on offering the strongest technical foundation in computing at any educational institute in the country. When studying Information Systems, you will gain a world-class education in computer networking, enterprise systems, digital marketing, and management. It is a holistic field of study that prepares you for a career in IT management, systems architecture, network engineering, or anything else where people, IT and systems meet.\n\nIn an increasingly networked and connected world, Information Systems professionals have never been more in demand. As an Information Systems student at NUS, you will gain the crucial foundation for a career in this fast-growing field.",
    "Link": "https://www.comp.nus.edu.sg/programmes/ug/is/"
  },
  {
    "Faculty": "College of Humanities and Sciences",
    "Major": "Data Science and Economics",
    "10th Percentile A Levels": "AAA/B",
    "90th Percentile A Levels": "AAA/A",
    "10th Percentile GPA": "#",
    "90th Percentile GPA": "#",
    "Description": "The new 4-year Bachelor of Science (Honours) with Major in Data Science and Economics (DSE) Cross-Disciplinary Programme (XDP) is offered under the NUS College of Humanities and Sciences (CHS).\n\nThe advent of Big Data has created opportunities for economists and policymakers to study economic systems and choices with a higher degree of precision using data science. This programme is designed to address emerging business and societal needs arising from digitalisation of the real and money economy and banking liberalisation, which require tight integration of knowledge from the complementary disciplines of data science and economics.  \n\nThis programme aims to produce students with strong foundational knowledge in data science and economics, as well as the fundamentals of theoretical and empirical economic analysis. Graduates will be equipped with the knowledge and skills to resolve complex data-scientific problems in various aspects of economics and to make effective business and policy decisions anchored on data.\n\nThe XDP is offered from Academic Year 2021/2022. This programme is the first of its kind in Singapore to integrate knowledge across the disciplines of data science and economics.",
    "Link": "https://chs.nus.edu.sg/programmes/dse/"
  },
  {
    "Faculty": "College of Humanities and Sciences",
    "Major": "Environmental Studies",
    "10th Percentile A Levels": "AAB/C",
    "90th Percentile A Levels": "AAA/A",
    "10th Percentile GPA": "#",
    "90th Percentile GPA": "#",
    "Description": "The new 4-year Bachelor of Environmental Studies Cross-Disciplinary Programme (XDP) builds on the expertise and strengths of the Bachelor of Environmental Studies (BES) programme which was launched in 2011.\n\nThe programme adopts an interdisciplinary and broad-based approach to effectively address national, regional and global environmental challenges. These include over-exploitation, pollution, climate change, land and water use, habitat degradation, and the building of liveable high-density cities. It seeks to develop environmental leaders and advocates who are scientifically informed and capable of formulating solutions for a sustainable future.\n\nThe XDP is offered from Academic Year 2021/2022. Students in the College of Humanities and Sciences (CHS) can also opt to read a Second Major in Life Sciences or Geography.\n\nThe XDP is offered jointly by the Faculty of Science (FoS) and Faculty of Arts and Social Sciences (FASS) with participation from the College of Design and Engineering, Faculty of Law, NUS Business School and the Saw Swee Hock School of Public Health.",
    "Link": "https://chs.nus.edu.sg/programmes/bes/"
  },
  {
    "Faculty": "College of Humanities and Sciences",
    "Major": "Food Science and Technology",
    "10th Percentile A Levels": "AAA/A",
    "90th Percentile A Levels": "AAA/A",
    "10th Percentile GPA": "3.86",
    "90th Percentile GPA": "3.97",
    "Description": "The undergraduate degree in Food Science and Technology covers the full educational spectrum of food science and technology, with a focus on four themes, namely: food quality and safety; new food product innovation; food processing; and nutrition.\n\nStudents will acquire knowledge of the science and technology of food, across the whole value chain. This spans upstream agricultural science and urban farming technology, to food science and manufacturing technology, food safety and sensory science, to downstream nutritional science and food waste valorisation.\n\nStudents may combine a Second Major or Minor in Nutrition with any major, including food science and technology, to gain fundamental understanding in nutrition science to supplement their primary/secondary major, and to learn about nutrition for daily applications.\n\nThose who are passionate in research may choose to read the Specialisation in Food Science and Technology (FST) Research and Innovation, which includes a compulsory capstone project and relevant courses. Students can conduct a research project and gain more knowledge in a specific field of interest in food science and technology.\n\nThis multidisciplinary programme is the only International Union of Food Science and Technology (IUFoST) accredited degree in Singapore.",
    "Link": "https://www.fst.nus.edu.sg/"
  },
  {
    "Faculty": "College of Humanities and Sciences",
    "Major": "Humanities and Sciences",
    "10th Percentile A Levels": "ABB/C",
    "90th Percentile A Levels": "AAA/A",
    "10th Percentile GPA": "3.67",
    "90th Percentile GPA": "3.97",
    "Description": "CHS offers a new way of teaching, learning and thinking that breaks students out of silos and emphasises the interface and interplay between disciplines. With access to the facilities and courses in both Faculty of Arts and Social Science (FASS) and Faculty of Science (FOS), students have the freedom and flexibility to explore different subjects and chart their own pathway.\n\nUnder CHS, students have the option to read a four-year Honours degree programme leading to a Bachelor of Arts, Bachelor of Social Sciences or Bachelor of Science.\n\nAsian Studies and Humanities:\n1. Chinese Language\n2. Chinese Studies\n3. English Language and Linguistics\n4. English Literature\n5. Global Studies\n6. History\n7. Japanese Studies\n8. Malay Studies\n9. Philosophy\n10. South Asian Studies\n11. Southeast Asian Studies\n12. Theatre and Performance Studies\n\nSocial Sciences:\n1. Anthropology\n2. Communications and New Media\n3. Economics\n4. Geography\n5. Political Science\n6. Psychology\n7. Social Work\n8. Sociology\n\nSciences:\n1. Chemistry\n2. Data Science and Analytics\n3. Life Sciences\n4. Mathematics\n5. Physics\n6. Quantitative Finance\n7. Statistics\n\nThe above majors listed do not have a special IGP, although majors such as Pharmaceutical Science are provided by NUS, hence only a faculty-wide IGP is provided. More information on each of these majors can be found on the link provided. ",
    "Link": "https://chs.nus.edu.sg/"
  },
  {
    "Faculty": "College of Humanities and Sciences",
    "Major": "Pharmaceutical Science",
    "10th Percentile A Levels": "AAA/A",
    "90th Percentile A Levels": "AAA/A",
    "10th Percentile GPA": "#",
    "90th Percentile GPA": "#",
    "Description": "Bachelor of Science (Pharmaceutical Science)\n\nPharmaceutical Science is a branch of science that deals with aspects of the science and technology of medical products. This includes but is not limited to the discovery, development, manufacture, regulation, and utilisation of medical products.\n\nThe Pharmaceutical Science (PHS) programme is designed to optimize a flexibility in curriculum to allow students to take up second majors, minors, undergraduate internships, research projects and overseas exchange programmes, along with a multitude of elective courses available for all NUS students.",
    "Link": "https://pharmacy.nus.edu.sg/study/undergraduate/"
  },
  {
    "Faculty": "College of Humanities and Sciences",
    "Major": "Pharmacy",
    "10th Percentile A Levels": "AAA/A",
    "90th Percentile A Levels": "AAA/A",
    "10th Percentile GPA": "3.86",
    "90th Percentile GPA": "3.98",
    "Description": "Bachelor of Pharmacy (Honours)\n\nPharmacists are healthcare professionals who are experts on medicines. Their main role within the healthcare system is to ensure that medicines are used appropriately and safely. In the process, they actively provide advice to physicians and other healthcare practitioners on the selection, dose, interactions and side effects of medicines. They also counsel patients on their medicines and monitor their health progress to ensure that patients achieve the best outcomes with their drug therapy. As a profession, pharmacy is continuously evolving in tandem with the changing healthcare landscape and advancement in medical sciences.\n\nOverall, the primary aim of the pharmacy programme is to equip graduates with the relevant knowledge and skills for entry into the pharmacy profession. The programme focuses on laying a strong foundation in pharmaceutical and clinical sciences so that graduates can readily apply these fundamental principles to their future employment, be it in community practice, hospital service, healthcare business, pharmaceutical industry or research.",
    "Link": "https://pharmacy.nus.edu.sg/study/undergraduate/"
  },
  {
    "Faculty": "College of Humanities and Sciences",
    "Major": "Philosophy, Politics, and Economics",
    "10th Percentile A Levels": "AAA/A",
    "90th Percentile A Levels": "AAA/A",
    "10th Percentile GPA": "#",
    "90th Percentile GPA": "#",
    "Description": "Bachelor of Arts (Honours) in Philosophy, Politics, and Economics\n\nIn this increasingly complex modern world, many of the issues that affect society are multidimensional in nature. The Philosophy, Politics, and Economics Cross-Disciplinary Programme (PPE-XDP) at the College of Humanities and Sciences aims to develop students? critical, applied and strategic thinking skills. These skills are crucial in the workplace of the future, where more emphasis will be placed on the ability to analyse situations from multiple perspectives and to develop creative and effective solutions.\n\nStudents in PPE-XDP will encounter a curated suite of multi-purpose intellectual tools from Philosophy, Political Science, and Economics, three well-established disciplines of the humanities and social sciences. The programme can be enriched with other special academic opportunities including the University Scholars Programme, Residential Colleges, NUS Overseas College, Student Exchange Programmes and internships.\n\nGraduates of PPE-XDP can look forward to careers in a myriad of industries, including banking and finance, business analysis, journalism, politics, public service, social work, and research.",
    "Link": "https://chs.nus.edu.sg/programmes/ppe/"
  },
  {
    "Faculty": "NUS Business School",
    "Major": "Business Administration",
    "10th Percentile A Levels": "AAB/C",
    "90th Percentile A Levels": "AAA/A",
    "10th Percentile GPA": "3.68",
    "90th Percentile GPA": "3.97",
    "Description": "The NUS Business School operates on a modular system.  Students have the flexibility to design their curricula and to pace their studies. They also have the freedom to take modules of their interest, subject to any prerequisite requirements and to modules availability through the Centralised Online Registration System (ModReg @ Edurec). Students considering a double degree programme may be further guided by its more restrictive requirements. New students choose their modules during the Orientation Week.\n\nBusiness students may freely choose and change their specialisations online at the beginning of every semester (including their very first semester). Indication of specialisation usually takes place at the end of the 2nd year to the start of the 3rd year.  Students typically enrol for modules that together are worth from 18 to 24 MCs (i.e. about 5 to 6 modules) in a regular semester; more can be taken on exceptional basis.  It is theoretically possible to complete a BBA in 2 years, and a BBA(Honours) in 3 years.\n\nMore than 70% of curricular time is spent in a class with less than 50 other students; more than half of classes conducted have no final examinations. The NUS BBA?s U.S.-style curricular structure and assessment rubric are complemented by U.K.-style focus on specialised contents with functional depths, as well as Singapore-style academic governance and educational zeal.\n\nStudents may enrich their curriculum by applying for the University Scholars Programme (USP), Student Exchange Program (SEP) and NUS Overseas Colleges (NOC), thus spending up to 1.5 years abroad whilst still fulfilling University study requirements.\n\nStudents enter the BBA as a stand-alone programme, as part of a double-degree programme, or as part of a Concurrent BBA Master of Science in Management (With CEMS Master in International Management) or BBA with Master of Public Policy (MPP) programme.  As such, our BBA welcomes students, as burgeoning leaders and managers, either directly from outside NUS or indirectly from other NUS faculties or departments.  MSc(Mgt) students may complete the BBA(H)/BBA(AccH) + USP + MSc(Mgt) + MIM(CEMS) in 5.5 years.  Top-flight students may also complete the BBA(H) + USP + MPP in 5.5 years with normal academic load.",
    "Link": "https://bba.nus.edu.sg/academic-programmes/bba-programme/introduction/"
  },
  {
    "Faculty": "NUS Business School",
    "Major": "Business Administration (Accountancy)",
    "10th Percentile A Levels": "AAB/B",
    "90th Percentile A Levels": "AAA/A",
    "10th Percentile GPA": "3.78",
    "90th Percentile GPA": "3.99",
    "Description": "The BBA(Acc.) programme is the BBA programme with an extended accountancy component. It is a full-fledged accountancy degree built on an especially strong foundation of business knowledge from other domains, and it is also a full-fledged business degree with a specialized rigorous focus on  accountancy.\n\nGraduates of the BBA(Acc.) degree programme are qualified to directly enter the professional stage of the Singapore CA Qualification, the path to becoming a Singapore Chartered Accountant.\n\nThe Singapore Chartered Accountant (CA) Qualification is the national CA qualification, developed by the Singapore Accountancy Commission (SAC) and administered by Singapore?s national accountancy professional body, the Institute of Singapore Chartered Accountants (ISCA). This internationally recognised and portable qualification is unique as it offers an Asian perspective. Taken together with a 3-year working experience with an SAC Accredited Training Organisation, which are accounting firms including the Big 4, candidates will receive a well-rounded education with both technical knowledge and practical guidance. The Singapore CA Qualification is continually reviewed to raise the ease of taking the programme while maintaining its standards to ensure that professionals with the Singapore Chartered Accountant designation come with the reputation of being highly competent. In short, it is designed to develop future business leaders.",
    "Link": "https://bba.nus.edu.sg/academic-programmes/bba-accountancy-programme/introduction/"
  },
  {
    "Faculty": "NUS Business School",
    "Major": "Real Estate",
    "10th Percentile A Levels": "BBC/B",
    "90th Percentile A Levels": "AAB/C",
    "10th Percentile GPA": "3.52",
    "90th Percentile GPA": "3.86",
    "Description": "The Bachelor of Science (Real Estate) degree programme trains real estate professionals to create and manage wealth in the context of the built environment. Recognising that Real Estate is Space and Money over Time, this programme is unique in providing an explicit link and interface between the spatial features of Real Estate and its financial attributes. Real Estate graduates play key roles in the development of the built environment as well as in the advancement of the quality of urban living through the transformation and management of real estate resources.\n\nWhether your interests? lies in Real Estate Finance and Investment, Real Estate Development, Valuation, Urban Planning or Property/Facilities Management, you can count on a good start now with the Department of Real Estate at NUS Business School.\n\nThe edge of a comprehensive NUS education also means Real Estate graduates can diversify into other areas, securing managerial positions in organisations like banks, fund and asset management companies, insurance companies and training establishments.",
    "Link": "https://bschool.nus.edu.sg/real-estate/bsc/"
  }
]
